// Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

int a = 50, b = 7, c = 100;
int max = Math.Max(a,Math.Max(b,c));
System.Console.WriteLine(max);